MSMunusamy/NuvoTon-Microcontroller/READ_ADC_VOLTAGE_DIVIDER_NETWORK/Library/Device/Nuvoton/M031Series/Include/pdma_reg.h
#define PDMA_TDSTS_TDIF3_Pos            (3)                                              /*!< PDMA_T::TDSTS: TDIF3 Position         */
#define PDMA_TDSTS_TDIF3_Msk            (0x1ul << PDMA_TDSTS_TDIF3_Pos)                  /*!< PDMA_T::TDSTS: TDIF3 Mask             */

#define PDMA_TDSTS_TDIF4_Pos            (4)                                              /*!< PDMA_T::TDSTS: TDIF4 Position         */
#define PDMA_TDSTS_TDIF4_Msk            (0x1ul << PDMA_TDSTS_TDIF4_Pos)                  /*!< PDMA_T::TDSTS: TDIF4 Mask             */

#define PDMA_TDSTS_TDIF5_Pos            (5)                                               /*!< PDMA_T::TDSTS: TDIF5 Position          */
#define PDMA_TDSTS_TDIF5_Msk            (0x1ul << PDMA_TDSTS_TDIF5_Pos)                   /*!< PDMA_T::TDSTS: TDIF5 Mask              */

#define PDMA_TDSTS_TDIF6_Pos            (6)                                               /*!< PDMA_T::TDSTS: TDIF6 Position          */
#define PDMA_TDSTS_TDIF6_Msk            (0x1ul << PDMA_TDSTS_TDIF6_Pos)                   /*!< PDMA_T::TDSTS: TDIF6 Mask              */

#define PDMA_TDSTS_TDIF7_Pos            (7)                                               /*!< PDMA_T::TDSTS: TDIF7 Position          */
#define PDMA_TDSTS_TDIF7_Msk            (0x1ul << PDMA_TDSTS_TDIF7_Pos)                   /*!< PDMA_T::TDSTS: TDIF7 Mask              */

#define PDMA_TDSTS_TDIF8_Pos            (8)                                               /*!< PDMA_T::TDSTS: TDIF8 Position          */
#define PDMA_TDSTS_TDIF8_Msk            (0x1ul << PDMA_TDSTS_TDIF8_Pos)                   /*!< PDMA_T::TDSTS: TDIF8 Mask              */

#define PDMA_ALIGN_ALIGNn_Pos           (0)                                              /*!< PDMA_T::ALIGN: ALIGNn Position        */
#define PDMA_ALIGN_ALIGNn_Msk           (0x1fful << PDMA_ALIGN_ALIGNn_Pos)                /*!< PDMA_T::ALIGN: ALIGNn Mask            */

#define PDMA_TACTSTS_TXACTFn_Pos        (0)                                              /*!< PDMA_T::TACTSTS: TXACTFn Position     */
#define PDMA_TACTSTS_TXACTFn_Msk        (0x1fful << PDMA_TACTSTS_TXACTFn_Pos)             /*!< PDMA_T::TACTSTS: TXACTFn Mask         */

#define PDMA_TOUTPSC_TOUTPSC0_Pos       (0)                                              /*!< PDMA_T::TOUTPSC: TOUTPSC0 Position    */
#define PDMA_TOUTPSC_TOUTPSC0_Msk       (0x7ul << PDMA_TOUTPSC_TOUTPSC0_Pos)             /*!< PDMA_T::TOUTPSC: TOUTPSC0 Mask        */

#define PDMA_TOUTPSC_TOUTPSC1_Pos       (4)                                              /*!< PDMA_T::TOUTPSC: TOUTPSC1 Position    */
#define PDMA_TOUTPSC_TOUTPSC1_Msk       (0x7ul << PDMA_TOUTPSC_TOUTPSC1_Pos)             /*!< PDMA_T::TOUTPSC: TOUTPSC1 Mask        */

#define PDMA_TOUTEN_TOUTENn_Pos         (0)                                              /*!< PDMA_T::TOUTEN: TOUTENn Position      */
#define PDMA_TOUTEN_TOUTENn_Msk         (0x3ul << PDMA_TOUTEN_TOUTENn_Pos)               /*!< PDMA_T::TOUTEN: TOUTENn Mask          */

#define PDMA_TOUTIEN_TOUTIENn_Pos       (0)                                              /*!< PDMA_T::TOUTIEN: TOUTIENn Position    */
#define PDMA_TOUTIEN_TOUTIENn_Msk       (0x3ul << PDMA_TOUTIEN_TOUTIENn_Pos)             /*!< PDMA_T::TOUTIEN: TOUTIENn Mask        */

#define PDMA_SCATBA_SCATBA_Pos          (16)                                             /*!< PDMA_T::SCATBA: SCATBA Position       */
#define PDMA_SCATBA_SCATBA_Msk          (0xfffful << PDMA_SCATBA_SCATBA_Pos)             /*!< PDMA_T::SCATBA: SCATBA Mask           */

#define PDMA_TOC0_1_TOC0_Pos            (0)                                              /*!< PDMA_T::TOC0_1: TOC0 Position         */
#define PDMA_TOC0_1_TOC0_Msk            (0xfffful << PDMA_TOC0_1_TOC0_Pos)               /*!< PDMA_T::TOC0_1: TOC0 Mask             */

#define PDMA_TOC0_1_TOC1_Pos            (16)                                             /*!< PDMA_T::TOC0_1: TOC1 Position         */
#define PDMA_TOC0_1_TOC1_Msk            (0xfffful << PDMA_TOC0_1_TOC1_Pos)               /*!< PDMA_T::TOC0_1: TOC1 Mask             */

#define PDMA_CHRST_CHnRST_Pos           (0)                                              /*!< PDMA_T::CHRST: CHnRST Position        */
#define PDMA_CHRST_CHnRST_Msk           (0x1fful << PDMA_CHRST_CHnRST_Pos)                /*!< PDMA_T::CHRST: CHnRST Mask            */

#define PDMA_REQSEL0_3_REQSRC0_Pos      (0)                                              /*!< PDMA_T::REQSEL0_3: REQSRC0 Position   */
#define PDMA_REQSEL0_3_REQSRC0_Msk      (0x3ful << PDMA_REQSEL0_3_REQSRC0_Pos)           /*!< PDMA_T::REQSEL0_3: REQSRC0 Mask       */

#define PDMA_REQSEL0_3_REQSRC1_Pos      (8)                                              /*!< PDMA_T::REQSEL0_3: REQSRC1 Position   */
#define PDMA_REQSEL0_3_REQSRC1_Msk      (0x3ful << PDMA_REQSEL0_3_REQSRC1_Pos)           /*!< PDMA_T::REQSEL0_3: REQSRC1 Mask       */

#define PDMA_REQSEL0_3_REQSRC2_Pos      (16)                                             /*!< PDMA_T::REQSEL0_3: REQSRC2 Position   */
#define PDMA_REQSEL0_3_REQSRC2_Msk      (0x3ful << PDMA_REQSEL0_3_REQSRC2_Pos)           /*!< PDMA_T::REQSEL0_3: REQSRC2 Mask       */

#define PDMA_REQSEL0_3_REQSRC3_Pos      (24)                                             /*!< PDMA_T::REQSEL0_3: REQSRC3 Position   */
#define PDMA_REQSEL0_3_REQSRC3_Msk      (0x3ful << PDMA_REQSEL0_3_REQSRC3_Pos)           /*!< PDMA_T::REQSEL0_3: REQSRC3 Mask       */

#define PDMA_REQSEL4_7_REQSRC4_Pos      (0)                                               /*!< PDMA_T::REQSEL4_7: REQSRC4 Position    */
#define PDMA_REQSEL4_7_REQSRC4_Msk      (0x3ful << PDMA_REQSEL4_7_REQSRC4_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC4 Mask        */

#define PDMA_REQSEL4_7_REQSRC5_Pos      (8)                                               /*!< PDMA_T::REQSEL4_7: REQSRC5 Position    */
#define PDMA_REQSEL4_7_REQSRC5_Msk      (0x3ful << PDMA_REQSEL4_7_REQSRC5_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC5 Mask        */

#define PDMA_REQSEL4_7_REQSRC6_Pos      (16)                                              /*!< PDMA_T::REQSEL4_7: REQSRC6 Position    */
#define PDMA_REQSEL4_7_REQSRC6_Msk      (0x3ful << PDMA_REQSEL4_7_REQSRC6_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC6 Mask        */

#define PDMA_REQSEL4_7_REQSRC7_Pos      (24)                                              /*!< PDMA_T::REQSEL4_7: REQSRC7 Position    */
#define PDMA_REQSEL4_7_REQSRC7_Msk      (0x3ful << PDMA_REQSEL4_7_REQSRC7_Pos)            /*!< PDMA_T::REQSEL4_7: REQSRC7 Mask        */

#define PDMA_REQSEL8_REQSRC8_Pos        (0)                                               /*!< PDMA_T::REQSEL8: REQSRC8 Position    */
#define PDMA_REQSEL8_REQSRC8_Msk        (0x3ful << PDMA_REQSEL8_REQSRC8_Pos)            /*!< PDMA_T::REQSEL8: REQSRC8 Mask        */
/**@}*/ /* PDMA_CONST */
/**@}*/ /* end of PDMA register group */
/**@}*/ /* end of REGISTER group */

#if defined ( __CC_ARM   )
#pragma no_anon_unions
#endif

#endif /* __PDMA_REG_H__ */
